/**
 * @copyright (C) COPYRIGHT 2022 Fortiortech Shenzhen
 * @file      Customer.h
 * @author    Fortiortech  Application Team
 * @date      2022-07-13
 * @brief     This file contains all the common data parameter used for Motor Control.
 */
 
 /* Define to prevent recursive inclusion ----------------------------------- */
#ifndef __CUSTOMER_H_
#define __CUSTOMER_H_

 /**********************基本参数*****************************
 1. 芯片参数
 2. 电机参数
 3. 电流采样参数
 4. 母线电压采样参数
  **************************************************************/
/* ----------------------------------------------------------------------------------------------------------------------------
                                             1.芯片参数                                                 
---------------------------------------------------------------------------------------------------------------------------- */
#define PWM_FREQUENCY                   (20.0)                        ///< (kHz) 载波频率 //YK30
#define PWM_DEADTIME                    (0.9)                         ///< (us) 死区时间
#define MIN_WIND_TIME                   (PWM_DEADTIME+0.8)            ///< (us) 单电阻最小采样窗口，建议值死区时间+0.9us //YK 1.0

/**
 * @brief 预驱有效电平选择
 * @param High_Level     驱动高电平有效
 * @param Low_Level      驱动低电平有效
 * @param UP_H_DOWN_L    上桥臂高电平有效，下桥臂低电平有效
 * @param UP_L_DOWN_H    上桥臂低电平有效，下桥臂高电平有效
 */
#define PWM_Level_Mode                 (UP_H_DOWN_L)

/* ----------------------------------------------------------------------------------------------------------------------------

                                             2.电机参数                                                 
---------------------------------------------------------------------------------------------------------------------------- */
#define Pole_Pairs                      (3.0)                         ///< 极对数
#define LD                              (0.0004*0.7)                ///< (H) D轴电感 48V:0.0004*1.0  72V:0.0009*1.0
#define LQ                              (0.0004*0.7)                ///< (H) Q轴电感 48V:0.0004*1.0	 72V:0.0009*1.0
#define RS                             	(0.25*0.7)                   ///< (Ω) 相电阻 48V:0.25*1.0   72V:0.3*1.0
#define Ke                              (8.2 *0.7)	              ///< (V/KRPM)反电动势常数 48V:8.2*1.0 72V:11.9*1.0
#define MOTOR_SPEED_BASE                (8400.0)                    ///< (RPM) 速度基准

/* ----------------------------------------------------------------------------------------------------------------------------
                                             3.电流采样参数                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief  ADC参考电压配置
 * @param (VREF3_0)       参考电压设置为3.0V
 * @param (VREF4_0)       参考电压设置为4.0V
 * @param (VREF4_5)       参考电压设置为4.5V
 * @param (VREF5_0)       参考电压设置为5.0V
 */
#define HW_ADC_VREF                     (VREF4_5)                      ///< (V) ADC参考电压

#define HW_RSHUNT                       (0.003)                        ///< (Ω) 采样电阻

/**
 * @brief  运放模式选择
 * @param (AMP_NOMAL)       外部运放
 * @param (AMP_PGA_DUAL)    内部PGA双端差分输入( 放大倍数的标定外部引脚串1kΩ电阻)
 */
#define HW_AMP_MODE                     (AMP_NOMAL)                   ///< 运放模式选择       

/**
 * @brief  运放0偏置电压配置（根据实际电路匹配）
 * @param (Enable)       运放0有接VHALF
 * @param (Disable)      运放0没接VHALF
 */
#define AMP0_VHALF                      (Enable)                       ///< 运放0偏置电压配置    

/**
 * @brief 运放放大倍数配置
 * @param (AMP2x)       内部PGA放大2倍
 * @param (AMP4x)       内部PGA放大4倍
 * @param (AMP8x)       内部PGA放大8倍
 * @param (AMP16x)      内部PGA放大16倍
 * @param (xxxxxx)      外部放大模式填写相应倍数
 */
#define HW_AMPGAIN                      (10.0)                        ///< 放大倍数设置     

/**
 * @brief 电流采样模式选择
 * @param (Single_Resistor)    单电阻电流采样模式
 * @param (Double_Resistor)    双电阻电流采样模式
 * @param (Three_Resistor)     三电阻电流采样模式
 */
#define Shunt_Resistor_Mode            (Single_Resistor)              ///< 电流采样模式选择  

/* ----------------------------------------------------------------------------------------------------------------------------
                                             4.母线电压采样参数                                                  
---------------------------------------------------------------------------------------------------------------------------- */
#define RV1                            (20.0)                         ///< (kΩ) 母线电压分压电阻1
#define RV2                            (1.0)                          ///< (kΩ) 母线电压分压电阻2


 /**********************电机运行参数*****************************
 1.  正反转模式
 2.  预定位参数
 3.  启动参数
 4.  调速模式参数
 5.  环路参数 
 6.  FG输出 
 7.  过调制   
 8.  调速模式
 9.  观测器模式  
 10. 顺逆风模式
 11. 启停测试参数   
  **************************************************************/
/* ----------------------------------------------------------------------------------------------------------------------------
                                             1.正反转模式                                                  
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 正反转模式
 * @param (0)      正转
 * @param (1)      反转
 */
#define FRMODE                          (1)                           ///< 正反转选择

/* ----------------------------------------------------------------------------------------------------------------------------
                                              2.预定位参数                                                    
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 预定位测试模式，用于验证电机输出正常，或者测试预定位力矩是否足够
 * @param (Disable)      禁止
 * @param (Enable)       使能
 */
#define AlignTestMode                  (Disable)                      ///< 预定位测试模式

/**
 * @brief UD,UQ预定位关联电压配置，宽电压的时候选择_防止高低电压时候定位力矩太小或太大-
 * @param (Disable)      禁止
 * @param (Enable)       使能
 */
#define Align_Associated_Vol_EN        (Enable)                      ///< UDQ预定位关联电压配置

#define Align_Angle                    (0.0)                          ///< (°) 预定位角度
#define Align_Time                     (0)                            ///< (ms) 预定位时间，单位：ms

#define UD_Duty                   _Q15(0.05)                          ///< UD预定位不关联电压时，UD预定位占空比设置

/* -----UD,UQ预定位关联电压时，UDQ预定位参数设定----- */
#define UDMAX                   _Q15(0.05)                           ///< 最低电压的UD定位占空比，电压为欠压保护值
#define UDMIN                   _Q15(0.08)                           ///< 最高电压的UD定位占空比，电压为过压保护值

/* ----------------------------------------------------------------------------------------------------------------------------
                                             3.启动参数                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 启动模式选择
 * @param (Open_Start)        开环强拖启动
 * @param (Omega_Start)       Omega启动，吸尘器Omega启动
 * @param (Open_Omega_Start)  先开环启，后Omega启动
 */
#define Open_Start_Mode                (Omega_Start) //YK 2023-4-2 Open_Omega_Start

/* -----启动电流----- */
#define ID_Start_CURRENT               I_Value(0.0)                   ///< (A) D轴启动电流，常用设置为0
#define IQ_Start_CURRENT               I_Value(1.5)                  ///< (A) Q轴启动电流，根据电机实际调整

#define IQ_RUN_CURRENT                 I_Value(1.5)                   ///< (A) 切mode1时刻电流值

/* -----启动的ATO参数设置----- */
#define ATO_BW                         (10.0)                         ///< (Hz) ATO的带宽设置，经典值为1.0-200.0，AO观测器，第一个ATO会小一点
#define ATO_BW_RUN                     (70.0)
#define ATO_BW_RUN1                    (120.0)
#define ATO_BW_RUN2                    (140.0)
#define ATO_BW_RUN3                    (160.0)
#define ATO_BW_RUN4                    (180.0)

#define SPD_BW                         (15.0)                         ///< 速度滤波的带宽设置，此值不常改，经典值为5.0-40.0

#define MOTOR_SPEED_SMOMIN_RPM         (1200.0)                       ///< (RPM) SMO运行最小转速 

/* -----OMEGA启动参数----- */
#define Motor_Omega_Ramp_ACC_Antiwind  (2.0)                          ///< 顺风时强制速度的爬坡增量   
#define Motor_Omega_Ramp_ACC           (10.0)                         ///< 静止启动时强制速度的爬坡增量   
#define MOTOR_OMEGA_ACC_MIN            (200.0)                        ///< (RPM) 估算转速的最小切换转速
#define MOTOR_OMEGA_ACC_END            (500.0)                        ///< (RPM) 强制转速的最大转速

/* -----mode0切mode1转速----- */
#define MOTOR_LOOP_RPM                 (400.0)                       ///< (RPM) 由mode 0到mode1切换转速，即闭环切换转速 //YK 2000.0

/* -----启动时候的电流环KPKI设置值----- */
#define DQKPStart                      _Q12(1.0)                      ///< 启动时DQ轴KP
#define DQKIStart                      _Q15(0.01)                     ///< 启动时DQ轴KI

/* -----切环之后的电流环KPKI设置值----- */
#define DQKP                           _Q12(0.7)                      ///< 切到闭环后DQ轴KP //1.0
#define DQKI                           _Q15(0.001)                     ///< 切到闭环后DQ轴KI  //0.02

/* -----D轴限幅参数设置----- */
#define DOUTMAX                        _Q15(0.99)                     ///< D轴最大限幅值，常用不限制，给0.99；单位：输出占空比
#define DOUTMIN                        _Q15(-0.99)                    ///< D轴最小限幅值，常用不限制，给-0.99；单位：输出占空比

/* -----Q轴限幅参数设置----- */
#define QOUTMAX                        _Q15(0.99)                     ///< Q轴最大限幅值，常用不限制，给0.99；单位：输出占空比
#define QOUTMIN                        _Q15(-0.99)                    ///< Q轴最小限幅值，常用不限制，给-0.99；单位：输出占空比

/* ----------------------------------------------------------------------------------------------------------------------------
                                             4. PWM调速模式参数                                                  
---------------------------------------------------------------------------------------------------------------------------- */
/* -----电机开机、关机的设置----- */
#define OFFPWMDuty                     _Q15(0.09)                     ///< 关机PWM占空比，小于该占空比关机                                                                                ///< /< 关机PWM占空比，小于该占空比时关机
#define OFFPWMDutyHigh                 _Q15(1.0)                      ///< 关机PWM占空比，大于该占空比关机
#define ONPWMDuty                      _Q15(0.15)                     ///< 开机PWM占空比，大于该占空比时开机
#define MINPWMDuty                     _Q15(0.1)                      ///< 速度曲线上最小PWM占空比
#define MAXPWMDuty                     _Q15(0.85)                     ///< 速度曲线上最大PWM占空比

/**
 * @brief PWM调速 PWM极性选择
 * @param (PosiPWMDUTY)      正逻辑
 * @param (NegaPWMDUTY)      反逻辑
 */
#define PWMDUTY_Choose                 (PosiPWMDUTY)

/* -----PWM开关机滤波设置----- */
#define MotorOnFilterTime              (20)                           ///< (ms) 开机滤波值       
#define MotorOffFilterTime             (20)                           ///< (ms) 关机滤波值

/* ----------------------------------------------------------------------------------------------------------------------------
                                             5. 环路参数                                                 
---------------------------------------------------------------------------------------------------------------------------- */
#define SPEED_LOOP_TIME                (1)                            ///< (ms) 外环调节周期

/* -----外环KPKI设置----- */
#define SKP                            _Q12(0.3)                      ///< 外环KP
#define SKI                            _Q15(0.002)                    ///< 外环KI  

/* -----外环PI最大最小输出幅值限制----- */
#define SOUTMAX                        I_Value(40.0)                  ///< (A) 外环最大限幅值 18.0在 之前给小了
#define SOUTMIN                        I_Value(0.00)                  ///< (A) 外环最小限幅值

/* -----电流控制模式下速度曲线的最大最小值----- */
#define Motor_Max_Current              I_Value(18.0)                  ///< (A) 运行最大电流
#define Motor_Min_Current              I_Value(10.0)                   ///< (A) 运行最小电流

/* -----电流控制模式下速度曲线的最大最小值----- */
#define MOTOR_SPEED_MAX_RPM            (4200.0)                      ///< (RPM) 运行最大转速 90000
#define MOTOR_SPEED_MIN_RPM            (500.0)                      ///< (RPM) 运行最小转速 15000

/* -----功率控制模式下速度曲线的最大最小值----- */
#define Motor_Max_Power                (7000)                         ///< 运行最大功率       
#define Motor_Min_Power                (800)                          ///< 运行最小功率

/* -----外环选择功率环或速度环----- */
#define POWER_LOOP_CONTROL             (0)                            ///< 恒功率环
#define SPEED_LOOP_CONTROL             (1)                            ///< 恒转速环
#define CURRENT_LOOP_CONTROL           (2)                            ///< 恒电流环（无外环）
#define Motor_Control_Mode             (SPEED_LOOP_CONTROL)

/* -----环路爬坡增量----- */
#if (Motor_Control_Mode == CURRENT_LOOP_CONTROL) 
#define Motor_Inc                       I_Value(0.01)                 ///< 电流环增量
#define Motor_Dec                       I_Value(0.01)                 ///< 电流环减量 
#else 
#define Motor_Inc                       100                           ///< 速度/功率环增量
#define Motor_Dec                       100                           ///< 速度/功率环减量
#endif

/* ----------------------------------------------------------------------------------------------------------------------------
                                                       6. FG输出                                                  
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief FG输出使能
 * @param (Disable)      禁止
 * @param (Enable)       使能
 */
#define FG_Enable                       (Disable)                      ///< FG输出使能 YK 2023年4月1日10:44:12 Enable

#define FG_K                            (1)                           ///< FG频率输出倍数

/* ----------------------------------------------------------------------------------------------------------------------------
                                                        7. 过调制                                                  
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 过调制
 * @param (Disable)      禁止
 * @param (Enable)       使能
 */
#define OverModulation                 (Disable)                      ///< 开启过调制UD,UQ会被放大1.15倍，但极限状态可能导致电流畸变                                  

/* -----弱磁配置----- */
#define WEAK_MAGNETIC_EN               (0)                            ///< 弱磁使能
#define WEAK_MIN_CURRENT               (0.0)                          ///< 弱磁最小电流
#define WEAK_MAX_CURRENT               (2.0)                          ///< 弱磁最大电流
#define WEAK_MIN                       I_Value(WEAK_MIN_CURRENT)      ///< 弱磁最小值
#define WEAK_MAX                       I_Value(-WEAK_MAX_CURRENT)     ///< 弱磁最大值

/* ----------------------------------------------------------------------------------------------------------------------------
                                                      8. 调速模式                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 调速模式选择
 * @param (PWMMODE)          PWM调速
 * @param (SREFMODE)         模拟调速
 * @param (NONEMODE)         直接给定值，不调速
 * @param (KEYMODE)          按键调速模式
 * @param (ONOFFTEST)        启停测试模式
 */
#define SPEED_MODE                     (NONEMODE)                   ///< 调速模式配置 

/* ----------------------------------------------------------------------------------------------------------------------------
                                                      9. 观测器模式                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 观测器选择
 * @param (SMO)         SMO ,滑膜估算
 * @param (PLL)         PLL ,锁相环
 * @param (AO)          AO ,自适应估算器
 */
#define EstimateAlgorithm              (AO)                         ///< 观测器配置

/* --------------------------------------------------------------------------------------------------------------------------
                                                      10. 顺逆风模式配置                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/**
 * @brief 顺逆风检测方式
 * @param (NoTailWind)      无逆风顺风判断
 * @param (RSDMethod)       RSD比较器方法
 * @param (BEMFMethod)      BEMF比较器方法
 */ 
#define TailWind_Mode                  (BEMFMethod)                   ///< 顺逆风检测方式配置 

/* ----------------------------------------------------------------------------------------------------------------------------
                                                      11. 启停测试参数                                                 
---------------------------------------------------------------------------------------------------------------------------- */
/* -----启停测试参数配置----- */
#define StartON_Time                  (3000)                          ///< (ms) 启动运行时间
#define StartOFF_Time                 (100)                           ///< (ms) 停止时间

#define Motor_ONOFF_Current            I_Value(8.0)                   ///< (A) 电流环时，启停测试电流值
#define MOTOR_ONOFF_RPM                (15000.0)                      ///< (RPM) 速度环时，启停测试转速
#define Motor_ONOFF_Power              (1500)                         ///< 功率环时，启停测试功率

/* -----停机刹车选择----- */
#define StopBrakeFlag                  (0)
#define StopWaitTime                   (300)                           ///< (ms) 刹车等待时间
#define MOTOR_SPEED_STOP_RPM           (120000.0)                     ///< (RPM) 刹车阈值速度

#endif
