/* --------------------------- (C) COPYRIGHT 2020 Fortiortech ShenZhen -----------------------------
    File Name      : Protect.h
    Author         : Fortiortech  Appliction Team
    Version        : V1.0
    Date           : 2020-09-30
    Description    : This file contains protection parameter used for Motor Control.
----------------------------------------------------------------------------------------------------
                                       All Rights Reserved
------------------------------------------------------------------------------------------------- */

/* Define to prevent recursive inclusion -------------------------------------------------------- */
#ifndef __PROTECT_H_
#define __PROTECT_H_

/***********************************保护参数值************* 
1.过流保护参数配置区域 
2.过欠压保护参数配置区域 
3.堵转保护参数配置区域
4.启动保护参数配置区域  
5.缺相保护参数配置区域
**********************************************************/
/* ----------------------------------------------------------------------------------------------------------------------------
                                      1.过流保护参数配置区域                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/* -----硬件过流保护比较值来源----- */
#define Compare_Mode                   (Compare_DAC)                                               ///< 硬件过流值的来源

/* -----硬件过流保护值----- */
#define OverHardcurrentValue           (50.0)                                                       ///< (A) DAC模式下的硬件过流值

/* -----软件过流保护值----- */
#define OverSoftCurrentValue           I_Value(45.0)                           	                   ///< (A) 软件过流值

/* ----------------------------------------------------------------------------------------------------------------------------
                                      2.过欠压保护参数配置区域                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/* -----过欠压保护使能----- */
#define VoltageProtectEnable           (0)                                                         ///< 电压保护，0,不使能；1，使能

/* -----过欠压保护值----- */
#define Over_Protect_Voltage           (31.5)                                                     ///< (V) 直流电压过压保护值
#define Over_Recover_Vlotage           (30.5)                                                     ///< (V) 直流电压过压保护恢复值
#define Under_Protect_Voltage          (9.5)                                                     ///< (V) 直流电压欠压保护值
#define Under_Recover_Vlotage          (10.5)                                                     ///< (V) 直流电压欠压保护恢复值


/* ----------------------------------------------------------------------------------------------------------------------------
                                      3.堵转保护参数配置区域                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/* -----堵转保护使能----- */
#define StallProtectEnable             (0)                                                         ///< 堵转保护，0,不使能；1，使能

/* -----堵转保护参数----- */
#define StallProtect1EsValue           (190)
#define MOTOR_SPEED_STAL2_RPM          (2000.0)
#define StallProtec2tEsValue           (150)
#define MOTOR_SPEED_STAL3_MAX_RPM      (4500.0)                                                    ///< (RPM) 堵转保护转速
#define MOTOR_SPEED_STAL3_MIN_RPM      (1800.0)

/* ----------------------------------------------------------------------------------------------------------------------------
                                      4.启动保护参数配置区域                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/* -----启动保护使能----- */
#define StartProtectEnable             (1)                                                         ///< 启动保护，0,不使能；1，使能

/* -----启动保护参数----- */
#define StartProtect1EsValue           (600)
#define StartProtect2EsValue           (200)

/* ----------------------------------------------------------------------------------------------------------------------------
                                      5.缺相保护参数配置区域                                                   
---------------------------------------------------------------------------------------------------------------------------- */
/* -----缺相保护使能----- */
#define PhaseLossProtectEnable         (0)                                                         ///< 缺相保护，0,不使能；1，使能

/* -----缺相保护参数----- */
#define PhaseLossCurrentValue1         I_Value(0.10)                                               ///< (A)  缺相电流值，运行时缺相保护值。
#define PhaseLossCurrentValue2         I_Value(0.10)                                               ///< (A)  缺相电流值，启动时缺相保护值。

/* -----偏置电压异常保护使能----- */
#define CurOffsetProtectEnable         (0)                                                         ///< 电流保护，0,不使能；1，使能

#endif

