/* --------------------------- (C) COPYRIGHT 2020 Fortiortech ShenZhen -----------------------------
    File Name      : GPIOInit.c
    Author         : Fortiortech  Appliction Team
    Version        : V1.0
    Date           : 2020-09-30
    Description    : This file contains GPIO initial function used for Motor Control.
----------------------------------------------------------------------------------------------------  
                                       All Rights Reserved
------------------------------------------------------------------------------------------------- */
/* Includes -------------------------------------------------------------------------------------*/
#include <FU68xx_2.h>
#include <Myproject.h>

/* -------------------------------------------------------------------------------------------------
    Function Name  : GPIO_Default_Init
    Description    : 为提高芯片的抗干扰能力，降低芯片功耗，请在具体项目时，将不需要用的GPIO默认都配置为输入上拉。
    Date           : 2020-09-30
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void GPIO_Default_Init(void)                                                                       //为提高芯片的抗干扰能力，降低芯片功耗，请在具体项目时，将不需要用的GPIO默认都配置为输入上拉。
{
  P2_OE = 0;
  P2_PU = P21|P22|P23|P24|P25|P26|P27;                                                             // 需确认这些端口能接受上拉
  
  P3_OE = 0;
  P3_PU = P30|P31|P32|P33|P34|P35|P36|P37;                                                         // 需确认这些端口能接受上拉
  
  P0_OE = 0;
  P0_PU = P00|P01|P02|P03|P04|P05|P06|P07;                                                         // 需确认这些端口能接受上拉
  
  P1_OE = 0;
  P1_PU = P10|P11|P12|P13|P14|P15|P16|P17;                                                         // 需确认这些端口能接受上拉
  
  P4_OE = 0;
  P4_PU = P40|P41;                                                                                 // 使用步进电机时，P40，P41不能配置输入上拉，上拉会导致直通
  
}

/* -------------------------------------------------------------------------------------------------
    Function Name  : GPIO_Init
    Description    : GPIO初始化配置,可将I/O口配置成输入或输出模式，上拉还是不上拉，模拟输出还是数字输出
    Date           : 2020-09-30
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void GPIO_Init(void)
{
//    SetBit(P0_OE, P05);
//    SetBit(P0_PU, P05);
//    GP05 = 1;
	  SetBit(P0_OE, P04);
    SetBit(P0_PU, P04);
    GP04 = 1;
//	
	
}

