/* --------------------------- (C) COPYRIGHT 2020 Fortiortech ShenZhen -----------------------------
    File Name      : UARTInit.c
    Author         : Fortiortech  Appliction Team
    Version        : V1.0
    Date           : 2020-09-30
    Description    : This file contains UART initial function used for Motor Control.
----------------------------------------------------------------------------------------------------  
                                       All Rights Reserved
------------------------------------------------------------------------------------------------- */
#include <FU68xx_2.h>
#include <Myproject.h>
/* Private variables ----------------------------------------------------------------------------*/
MCUART Uart;

void SPI_Init(void)
{
    ClrBit(SPI_CR1, SPIEN);                                            // 0,disable SPI;1 enable
    /*-------------------------------------------------------------------------------------------------
      SPI管脚配置
        1、禁止UART复用，P06配置为MISO，P05配置为MOSI
        2、禁止比较器输出复用，P07配置为SCLK
    -------------------------------------------------------------------------------------------------*/
    ClrBit(PH_SEL, UARTEN);                                              // 0,P06 as GPIO or SPI_MISO,P05 as GPIO or SPI_MOSI;1,P06 and p07 as USART
    /*-------------------------------------------------------------------------------------------------
        SPI时钟相位/极性配置
        CPHA = 0, CPOL = 0:上升沿接收，下降沿发送，空闲电平为低
        CPHA = 0, CPOL = 1:上升沿发送，下降沿接收，空闲电平为高
        CPHA = 1, CPOL = 0:上升沿发送，下降沿接收，空闲电平为低
        CPHA = 1, CPOL = 1:上升沿接收，下降沿发送，空闲电平为高
    -------------------------------------------------------------------------------------------------*/
    SetReg(SPI_CR0, CPHA | CPOL, CPOL);
    /*-------------------------------------------------------------------------------------------------
        SPI从方式选择配置
        00：3线从方式或3线主方式，NSS信号不连到端口管脚
        01：4线从方式或4线多主方式，NSS配置为输入
        1x：4线单主方式，NSS配置为输出，NSS信号输出x电平
    -------------------------------------------------------------------------------------------------*/
    SetReg(SPI_CR1, NSSMOD0 | NSSMOD1, NSSMOD0 | NSSMOD1);
    SetBit(SPI_CR0, SPIMS);                          // 0:Slave, 1:Master
    /*-------------------------------------------------------------------------------------------------
        SPI中断配置
        SPIF：SPI字节传输完成中断标志，硬件置位，软件清零
        WCOL：SPI写冲突中断（发送缓冲器非空时写操作），硬件置位，软件清零
        MODF：SPI方式错误中断（多主方式NSS被拉低，MSTEN和SPIEN被清零）硬件置位，软件清零
        RXOVRN：SPI接收溢出中断（SPI接收缓冲器接收溢出），硬件置位，软件清零
    -------------------------------------------------------------------------------------------------*/
    SetReg(SPI_CR1, SPIIF | WCOL | MODF | RXOVR, 0x00);              // SPI所有中断清除
    SPIIE = 0;                                             // SPI中断使能
    SPI_CLK = 0;                                                                 // Fspi = Fcpu / (2*(SPI_CLK + 1)) = 6MHz
    SetBit(SPI_CR1, SPIEN);                                        // enable SPI
}


/* -------------------------------------------------------------------------------------------------
    Function Name  : UART_Init
    Description    : UART初始化配置
    Date           : 2020-09-30
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void UART_Init(void)
{
    SetBit(PH_SEL, UARTEN);                                                                        // p0[6]as UART_RXD; p0[5]as UART_TXD
    UT_MOD1 = 0;
    UT_MOD0 = 1;                                                                                   // 8bit波特率可变UART模式
    SM2 = 0;                                                                                       // 禁止Mode2和Mode3多机通讯
    REN = 1;                                                                                       // 使能接收
    ES0 = 0;                                                                                       // 先关中断

    PUART1=0;                                                                                      // 中断优先级时最低
    PUART0=0;

    UT_BAUD =0x9b;                                                                                 // default baudrate:9600-0x9b,1200-0x4E1
    ES0 = 1;                                                                                       // 发送/接受中断使能
}

/* -------------------------------------------------------------------------------------------------
    Function Name  : UartTxdate
    Description    : UART发送一串数据
    Date           : 2020-09-30
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void UartTxdate(uint16* sndBuf, int32 len)
{
    uint16 i=0;
    for(i=0;i<len;i++)
    {
        UART_SendData(*sndBuf++);
    }
}

/* -------------------------------------------------------------------------------------------------
    Function Name  : UART_SendData
    Description    : UART发送一个字节数据
    Date           : 2020-09-30
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void UART_SendData(unsigned char T_Data)
{
    UT_DR = T_Data;
    while(!(TI==1));                                                                               // 等待发送完成
    TI = 0;                                                                                        // 发送完成中断标志位清零
}
